## Plans :thumbsup:
This is a **layered run** with 2 layers remaining to apply.  Layered runs require multiple rounds of planning and applying.  After applying this layer, comment `terrateam plan` to plan the next layer and continue until all layers are applied.

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layer-one | Success :thumbsup:
**Dir**: layer-one
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_internet_gateway.layer_one_igw will be created
+   resource "aws_internet_gateway" "layer_one_igw" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags_all = (known after apply)
+       vpc_id   = (known after apply)
    }

  # aws_route_table.layer_one_route_table will be created
+   resource "aws_route_table" "layer_one_route_table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = (known after apply)
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
+       tags_all         = (known after apply)
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.layer_one_route_table_association will be created
+   resource "aws_route_table_association" "layer_one_route_table_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.layer_one_subnet will be created
+   resource "aws_subnet" "layer_one_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "LayerOneSubnet"
        }
+       tags_all                                       = {
+           "Name" = "LayerOneSubnet"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.layer_one_vpc will be created
+   resource "aws_vpc" "layer_one_vpc" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "LayerOneVPC"
        }
+       tags_all                             = {
+           "Name" = "LayerOneVPC"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 9.27 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| layer-one | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **9.27** | **9.27** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
